Autodesk.Revit.DB.PDFExportOptions.SetPdfParameterProvider(Autodesk.Revit.DB.IPDFParametersProvider)
Sets PdfParameterProvider.
pParameterProvider:
Set to nullptr to remove ParameterProvider.
Since:
2022

Autodesk.Revit.DB.PDFExportOptions.GetPdfParameterProvider
Gets PdfParameterProvider.
Since:
2022

Autodesk.Revit.DB.PDFExportOptions.IsValidNamingRule(System.Collections.Generic.IList{Autodesk.Revit.DB.TableCellCombinedParameterData})
Whether naming rule is valid or not.
Remarks:
If true, this naming rule is a valid.
If false, this naming rule is not valid for empty naming rule or illegal characters, such as \ / : * ? " < > |.
namingRule:
The naming rule to be validated.
Returns:
Whether or not the name is valid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.PDFExportOptions.SetNamingRule(System.Collections.Generic.IList{Autodesk.Revit.DB.TableCellCombinedParameterData})
Sets the naming rule.
namingRule:
The naming rule.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The namingRule is empty or contains illegal characters.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.PDFExportOptions.GetNamingRule
Gets a copy of the naming rule.
Returns:
The naming rule.
Since:
2022

Autodesk.Revit.DB.PDFExportOptions.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.PDFExportOptions.Combine
Whether export all views and sheets into one PDF file or multiple files.
Remarks:
If true, all exported views and sheets will be exported into one PDF file, whose file name would be specified by Autodesk.Revit.DB.PDFExportOptions.FileName.
If false, each exported view and sheet will have its own PDF file created, whose file name would be generated with NamingRule.
Since:
2022

Autodesk.Revit.DB.PDFExportOptions.StopOnError
Whether export process should stop when a view fails to export
Since:
2022

Autodesk.Revit.DB.PDFExportOptions.ReplaceHalftoneWithThinLines
Whether to replace halftone with thin lines.
Since:
2022

Autodesk.Revit.DB.PDFExportOptions.MaskCoincidentLines
Whether to mask coincident lines.
Since:
2022

Autodesk.Revit.DB.PDFExportOptions.HideScopeBoxes
Whether to hide scope boxes.
Since:
2022

Autodesk.Revit.DB.PDFExportOptions.HideUnreferencedViewTags
Whether to hide unreferenced view tags.
Since:
2022

Autodesk.Revit.DB.PDFExportOptions.HideReferencePlane
Whether to hide reference/work planes.
Since:
2022

Autodesk.Revit.DB.PDFExportOptions.HideCropBoundaries
Whether to hide crop boundaries.
Since:
2022

Autodesk.Revit.DB.PDFExportOptions.ViewLinksInBlue
Whether set view links blue.
Remarks:
If true, links will be visible as blue.
If false, they retain their default text color.
Since:
2022

Autodesk.Revit.DB.PDFExportOptions.OriginOffsetY
Offset between bottom sides of pdf content and paper. Always stored in unit of Feet.
Since:
2022

Autodesk.Revit.DB.PDFExportOptions.OriginOffsetX
Offset between left sides of pdf content and paper. Always stored in unit of Feet.
Since:
2022

Autodesk.Revit.DB.PDFExportOptions.PaperPlacement
Paper placement of either center or offset from corner.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2022

Autodesk.Revit.DB.PDFExportOptions.ColorDepth
Color depth of either black/white, gray scale or color.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2022

Autodesk.Revit.DB.PDFExportOptions.ExportQuality
The preferred export quality (DPI).
Remarks:
This quality setting is the equivalent of printer resolution found in advanced printer settings.
An effect of the setting is to control tessellation quality.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2022

Autodesk.Revit.DB.PDFExportOptions.RasterQuality
The preferred raster quality (DPI).
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2022

Autodesk.Revit.DB.PDFExportOptions.ZoomPercentage
Percentage of the zoom for the view.
Remarks:
This property would be ignored if the ZoomType is FitToPage.
Since:
2022

Autodesk.Revit.DB.PDFExportOptions.ZoomType
Zoom type of either fit to page or on a specific percentage.
Remarks:
This property would be ignored if the PaperFormat is Default.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2022

Autodesk.Revit.DB.PDFExportOptions.AlwaysUseRaster
If true completely use raster processing for graphics,
otherwise use vector processing as much as possible.
Since:
2022

Autodesk.Revit.DB.PDFExportOptions.PaperFormat
Paper format.
Remarks:
When the PaperFormat is ExportPaperFormat.Default, which means "Use Sheet Size".
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The input paper format is invalid
Since:
2022

Autodesk.Revit.DB.PDFExportOptions.PaperOrientation
Paper orientation - Portrait/Landscape/Auto
Remarks:
Ignored when the PaperFormat is ExportPaperFormat.Default, which means "Use Sheet Size".
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2022

Autodesk.Revit.DB.PDFExportOptions.FileName
File name of the PDF when Autodesk.Revit.DB.PDFExportOptions.Combine is true.
Remarks:
PDF file extension (".pdf") would be automatically appended to the result file.
When Autodesk.Revit.DB.PDFExportOptions.Combine is false, this would be ignored.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.PDFExportOptions.#ctor
Creates a default options object.
Since:
2022

Autodesk.Revit.DB.PDFExportOptions
Options for PDF export
Since:
2022